/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*
*                              硬件平台:RockingDemo
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子科技有限公司
*
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : data.h
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz        2016/09/13        初始版本
********************************************************************************
*/


#ifndef __DATA_H
#define __DATA_H

#include "system.h"



typedef struct
{
    char Voltage;
// 以下为系统保留数据，系统层直接使用
    uint Systick1000;

    AdcStruct Adc;
}DataStruct;


#endif /*__Data_H*/

