/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*
*                              硬件平台:RockingDemo
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子可以有限公司
*
*                                OS原作者:王绍伟
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : app.h
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2016/09/13       初始版本
********************************************************************************
*/


#ifndef __APP_H
#define __APP_H


#include "data.h"


typedef struct
{
    DataStruct Data;
}AppStruct;

extern AppStruct App;

#endif /*__APP_H*/






