/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*
*                              硬件平台:RockingDemo
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子可以有限公司
*
*                                OS原作者:王绍伟
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : logic.h
*作用       : 
*原理       : 
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2014/06/21       初始版本
********************************************************************************
*/



#ifndef __LOGIC_H
#define __LOGIC_H


//extern void Usart2Process(Usart2Enum data);

void LogicTask(void);

#endif 

