/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子科技有限公司
*
*                                OS原作者:王绍伟
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : device_timer.h
*作用       : 软件定时器设备
*原理       : 基于系统节拍1000/S，即1mS一次虚拟出软件定时器
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz        2013/07/21       初始版本
********************************************************************************
*/
#ifndef __DEVICE_TIMER_H
#define __DEVICE_TIMER_H


#include "device_timer.h"


typedef enum 
{
    TimerSystick            = 0,
    TimerMessage            = 1	
}TimerModeEnum;	



void TimerSystick1000Routine(void);
void InitTimer(void);



#endif
