/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子科技有限公司
*
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : device_uart.h
*作用       : 串口设备
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2016/12/6        初始版本
********************************************************************************
*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DEVICE_ADC__H
#define __DEVICE_ADC__H

/* Includes ------------------------------------------------------------------*/






/* Exported functions ------------------------------------------------------- */
void InitAdc(void);
uint16_t GetAdcValue(uint8_t ch);
void AdcSystick100Routine(void);



#endif /* __DEVICEUART__H */
