/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子科技有限公司
*
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : device_pwm.h
*作用       : PWM头文件
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2016/12/21        初始版本
********************************************************************************
*/
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DEVICE_PWM_H
#define __DEVICE_PWM_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "system.h"
   


   
void InitTim3PWM(uint16_t FreqkHz);
void PwmSystick100Routine(void);   
   

  
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __DEVICE_PWM_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
