/*
********************************************************************************
*                                 嵌入式微系统
*                                     msOS
*
*                              主芯片:STM32F411re/cc
*                           江苏南大五维电子科技有限公司
*
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : device_systick.c
*作用       : 系统节拍
*原理       : 
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2016/12/7        初始版本
********************************************************************************
*/
#ifndef __DEVICE_SYSTICK_H
#define __DEVICE_SYSTICK_H

#define Systick10000Sum         2
#define Systick1000Sum          4
#define Systick100Sum           10

typedef enum
{
    Systick10000,
    Systick1000,
    Systick100
}SystickEnum;




void InitSystick(void);


#endif
